In [4]:
import pandas as pd
import numpy as np

df=pd.read_csv('../data/raw/GlobalLandTemperaturesByCountry.csv')
df

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
1,1743-12-01,NaN,NaN,Åland
2,1744-01-01,NaN,NaN,Åland
3,1744-02-01,NaN,NaN,Åland
4,1744-03-01,NaN,NaN,Åland
...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe
577461,2013-09-01,NaN,NaN,Zimbabwe

In [5]:
#checking NaN's
df.isna().sum()

dt                                   0
AverageTemperature               32651
AverageTemperatureUncertainty    31912
Country                              0
dtype: int64

In [10]:
df.isna().sum()/df.shape[0]

date                               0.000000
average_temperature                0.056542
average_temperature_unvertainty    0.055263
country                            0.000000
dtype: float64

In [9]:
#renaming columns
df=df.rename(columns={'dt':'date', 'AverageTemperature': 'average_temperature', 'AverageTemperatureUncertainty': 'average_temperature_unvertainty', 'Country': 'country'})

In [23]:
#changing data type
df['date']=pd.to_datetime(df['date'])

In [25]:
df.dtypes

date                               datetime64[ns]
average_temperature                       float64
average_temperature_unvertainty           float64
country                                    object
dtype: object

In [33]:
df2=df[(df['date'] >= '2000-01-01') & (df['date'] <= '2009-12-01')]

In [34]:
df2.isna().sum()

date                                 0
average_temperature                120
average_temperature_unvertainty      0
country                              0
dtype: int64

In [35]:
df2[df2['average_temperature'].isna()]

,date,average_temperature,average_temperature_unvertainty,country
23024,2000-01-01,NaN,0.571,Antarctica
23025,2000-02-01,NaN,0.555,Antarctica
23026,2000-03-01,NaN,0.526,Antarctica
23027,2000-04-01,NaN,0.639,Antarctica
23028,2000-05-01,NaN,0.639,Antarctica
...,...,...,...,...
23139,2009-08-01,NaN,0.646,Antarctica
23140,2009-09-01,NaN,0.566,Antarctica
23141,2009-10-01,NaN,0.479,Antarctica
23142,2009-11-01,NaN,0.511,Antarctica
23143,2009-12-01,NaN,0.590,Antarctica

In [37]:
df3 = df2[df2['country'] != 'Antarctica']
df3

,date,average_temperature,average_temperature_unvertainty,country
3074,2000-01-01,0.197,0.407,Åland
3075,2000-02-01,-0.023,0.399,Åland
3076,2000-03-01,0.615,0.429,Åland
3077,2000-04-01,4.124,0.348,Åland
3078,2000-05-01,8.557,0.447,Åland
...,...,...,...,...
577412,2009-08-01,18.465,0.489,Zimbabwe
577413,2009-09-01,22.831,0.329,Zimbabwe
577414,2009-10-01,24.544,0.429,Zimbabwe
577415,2009-11-01,23.886,0.421,Zimbabwe
577416,2009-12-01,24.731,0.430,Zimbabwe

In [39]:
df3.to_csv('../data/cleaned/global_temperatures_by_country_2000_2009_cleaned.csv')